# В фермерском хозяйстве в Карелии выращивают чернику. Она растет на круглой грядке, причем кусты высажены только по окружности. Таким образом, у каждого куста есть ровно два соседних. Всего на грядке растет N кустов. Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом, собирает ягоды с этого куста и с двух соседних с ним.

n = int(input('n= '))
lis = [int(x) for x in input('-> ').split()]
n = len(lis)
lis = lis + lis[:2]
ma = 0
for i in range(n):
    ma = max(ma, lis[i] + lis[i+1] + lis[i+2])
print(ma)